{
  "currentVersion": "2.4.0",
  "currentBuild": 19,
  "releaseDate": "2025-03-10",
  "earlyAccess": {
    "version": "3.0.0",
    "build": 20,
    "releaseDate": "2025-02-28"
  },
  "changeLog": [
    {
      "build": 20,
      "version": "3.0.0",
      "new": [
        "Tabs for Multitasking",
        "Standalone Terminal & Browser Windows",
        "Expanded Context Menu (Right-Click)",
        "Notification Drawer"
      ],
      "improve": [
        "Improved Hotkey System",
        "Enhanced In-App Browser",
        "Enhanced In-App Terminal",
        "Argument Handling",
        "Search Highlighting",
        "Card Extensions",
        "Settings & Performance"
      ],
      "bug": [
        "Fixed an issue causing terminal font corruption in some cases.",
        "Prevent errors when quitting the app with active AI processes",
        "Corrected placement of modals and windows.",
        "The \"update available\" badge is now hidden when an AI is running.",
        "Ensured relative paths work correctly in portable mode for AI interfaces.",
        "Improved app title rendering to be accurate and prevent duplicate hyphens.",
        "Addressed potential data inconsistencies for users upgrading from versions below 2.0.0 by resetting relevant storage."
      ]
    },
    {
      "build": 19,
      "version": "2.4.0",
      "new": [
        "Added ARM64 architecture",
        "Added Portable app",
        "Added option for dynamic title/taskbar name based on AI or page",
        "Added option to open app at last position/size or maximized",
        "Added ability to enable/disable AI interface extensions",
        "Added option to configure AI update check frequency",
        "Check for update on new card locate/install"
      ],
      "improve": [
        "Improve terminal process killing on terminate/close",
        "Update dashboard and audio generation icons",
        "Update AI installation and Settings clear popconfirm design",
        "Update uninstall modal design",
        "Update update details modal design"
      ],
      "bug": [
        "Resolve AI interface extension installation issues",
        "Correctly handle dots in repository names",
        "Fix error on closing app when an AI interface is running"
      ]
    },
    {
      "build": 18,
      "version": "2.3.1",
      "improve": [
        "Repositioned \"Close\" and \"Terminate AI\" confirmation pop-up.",
        "Improved module update checking behavior and performance.",
        "Added stash and drop functionality to card repository menu.",
        "Added animation to command items upon addition.",
        "Removed markdown viewer background.",
        "Removed modals footer background; close button is now minimal.",
        "Added security notice for extensions and modules installation.",
        "Extensions Page",
        " - Added skeleton loading, updated panel colors, and changed selected item indicator.",
        " - Modified tab appearance and improved empty search result text, and updated styles.",
        "Modules Page",
        " - Added changelog viewer, displays unloaded state, updated \"Update All\" button, and improved list item design.",
        " - Smaller tabs, button icons, homepage link, and fixed update checking with no modules.",
        "Updated design of update details and notification.",
        "Close menu on \"Open Folder\" or \"Open Homepage\"."
      ],
      "bug": [
        "Refresh modules list after installing or uninstalling a module.",
        "Resolve AI interface extension installation issues"
      ]
    },
    {
      "build": 17,
      "version": "2.2.1",
      "bug": [
        "Prevent modal overlay persistence when closing modals with tabs"
      ]
    },
    {
      "build": 16,
      "version": "2.2.0",
      "new": [
        "Git Cloning Enhancements: Added options for cloning single branches, specifying branch names, and setting clone depth.",
        "Repository Card Menu: Introduced a new menu item on Repository cards, providing access to branch management (view, switch), repository reset, unshallow, and commit details.",
        "Card Duplication: Added the ability to duplicate cards. "
      ],
      "improve": [
        "In-App Readme Viewer: Displays the readme file within the app for cards that are not yet installed.",
        "Staggered Card Update Checks: Card update checks are now performed sequentially on startup instead of all at once.",
        "Streamlined Pinning: Replaced the ribbon with an icon button for pinning cards.",
        "Shallow Cloning for AI Extensions: Utilizes shallow cloning for faster installation of AI extensions.",
        "Optimized AI Information: Uses the cardInfo modules method for AI information instead of the built-in method.",
        "Search Result Refinement: Hides the arguments category when search results are empty.",
        "Ctrl+Click Shortcuts:",
        " - Open a card's homepage in an external browser using Ctrl+click.",
        " - Open a card's project folder by Ctrl+click on 'Open Folder' in the card menu."
      ],
      "bug": [
        "Fixed an issue where card menu items might not function correctly.",
        "Resolved issues with the settings layout extending beyond the app screen.",
        "Correct the layout of customized card settings for smaller window sizes.",
        "Removed the update badge after a successful card update.",
        "The User component in card info is now rendered correctly when a valid picUrl is present.",
        "Resolved issues with the zoom functionality in the in-app browser.",
        "Fixed broken links within the in-app browser.",
        "The 'Extension Installed' button is no longer shown if an installation error occurs.",
        "The uninstall menu item is now hidden if a card has no installation directory."
      ]
    },
    {
      "build": 15,
      "version": "2.1.0",
      "new": [
        "Python Toolkit Extension"
      ],
      "improve": [
        "Apply terminal output color for AI installer",
        "Show extensions supported platforms icons"
      ],
      "bug": [
        "Disable extension install button for incompatible platforms",
        "Remove developer name from launch config modal"
      ]
    },
    {
      "build": 14,
      "version": "2.0.0",
      "new": [
        "Extension Support (Beta): Extend the functionality of the application with custom extensions!",
        "Terminal Enhancements:",
        "- Customization: A new settings section allows you to personalize the terminal's behavior and styling.",
        "- Colorized Output: Easier-to-read terminal output with color-coding based on message type (#20).",
        "- Copy/Paste: Support copy and paste text in the terminal with right-click (#20).",
        "Markdown Viewer: View Markdown files directly within the application.",
        "Content & Navigation:",
        "- README Integration: Access project README directly from the card menu.",
        "- Pinned Card Ribbons: Visually identify your pinned cards with a new ribbon design."
      ],
      "improve": [
        "Card Management:",
        "- Pinned cards are now displayed at the top of the list for easy access.",
        "- Non-installed cards are filtered out from \"Pinned\" and \"Recently Used\" categories (#21).",
        "- Card reordering now features a smooth animation.",
        "- Improved card design for better visibility and aesthetics.",
        "- The card container background is now slightly lighter.",
        "User Interface Enhancements:",
        "- The information modal has been redesigned for improved clarity and visibility.",
        "- Category icons have been updated to new colored versions with added descriptions.",
        "- Enhanced search functionality provides better results for developers and repositories.",
        "- The close button in the tools info modal now has a background on hover.",
        "- The search and filter backgrounds are lightened for better visibility.",
        "Process Management:",
        "- AI processes are now forcefully terminated before closing or restarting the application to prevent issues (#22).",
        "- Selected text in the terminal is now cleared automatically on copy.",
        "Initializer:",
        "- Python validation has been removed from the initializer.",
        "- The initializer design and window size has been enhanced for a better visual experience.",
        "Data Display:",
        "- Card repository information is now conditionally rendered, only appearing when data is available."
      ],
      "bug": [
        "Resolved an issue where SVG icons were not displayed correctly.",
        "Eliminated a 1-second app freeze during startup that occurred while checking for card updates.",
        "Fixed an issue where app elements would sometimes appear underneath the title bar.",
        "Ensured that modals and menus no longer obscure the title bar.",
        "Update ribbons on cards are now hidden when the card is not visible.",
        "Resolved an issue that prevented card auto-updates from working correctly on app startup."
      ]
    }
  ]
}